# -*- coding:utf8 -*- #
#-----------------------------------------------------------------------------------
# ProjectName: python3
# FileName: homework_for_day5
# Author: TangJianjun
# Date: 2020/7/10
# Description:
#-----------------------------------------------------------------------------------
# 1、给一个全局变量：shoe = "高跟鞋" 用global 修改全局变量 高跟鞋 为 高帮鞋
# 2、定义一个类，在类中定义4个函数，分别实现2个数的加、减、乘、除
# 3、写一个类，包含私有方法和私有变量和静态方法
# 4、封装一个文件，文件中写五个类，父类的一个方法被4个子类重写，实现了不同的行为
# 5、完成以下图形的输出
# 如图：
# 6、冒泡排序：
# 将list = [7, 4, 3, 67, 34, 1, 8]中的数据从小到大排序，最后输出结果为：[1, 3, 4, 7, 8, 34, 67]：提示冒泡排序，比较大小交换位置，或者用空杯交换原理
# 7、求1-2+3-4+5 ... 99的所有数的和
# 8、小芳的妈妈每天给她2.5元钱，她都会存起来，从存钱开始，每过5天她就会花去6元钱，请问要到第几天，小芳才可以存满100元钱
# 9、总结字符串，列表，元组，字典，集合各自有什么方法，作用分别是什么？
